In [5]:
import pandas
data = pandas.read_csv('data/titanic.csv', index_col='PassengerId')

In [6]:
data[:10]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [7]:
data.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [8]:
data['Pclass']

PassengerId
1      3
2      1
3      3
4      1
5      3
6      3
7      1
8      3
9      3
10     2
11     3
12     1
13     3
14     3
15     3
16     2
17     3
18     2
19     3
20     3
21     2
22     2
23     3
24     1
25     3
26     3
27     3
28     1
29     3
30     3
      ..
862    2
863    1
864    3
865    2
866    2
867    2
868    1
869    3
870    3
871    3
872    1
873    1
874    3
875    2
876    3
877    3
878    3
879    3
880    1
881    2
882    3
883    3
884    2
885    3
886    3
887    2
888    1
889    3
890    1
891    3
Name: Pclass, dtype: int64

In [9]:


data['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [10]:
data['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [11]:
data.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [12]:
data['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [13]:
data.count()

Survived    891
Pclass      891
Name        891
Sex         891
Age         714
SibSp       891
Parch       891
Ticket      891
Fare        891
Cabin       204
Embarked    889
dtype: int64

In [14]:
round(data['Survived'].value_counts()[1] / float(data['Survived'].count()) * 100, 2)

38.38

In [15]:
data['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [16]:
round(data['Pclass'].value_counts()[1] / float(data['Pclass'].count()) * 100, 2)

24.24

In [17]:
data['Age'].mean(axis=0)

29.69911764705882

In [18]:
data['Age'].median(axis=0)

28.0

In [19]:
data['SibSp'].corr(data['Parch'])

0.41483769862015668

In [20]:
data['Name'].where(data['Sex'] == 'female').str.extract('(?<=\()(?P<name>\w+)\s', expand=False).value_counts()

Elizabeth     6
Anna          5
Maria         4
Margaret      4
Mary          4
Ada           4
Florence      3
Edith         3
Jane          3
Martha        2
Alice         2
Catherine     2
Marie         2
Charlotte     2
Lily          2
Emily         2
Johanna       2
Elisabeth     2
Clara         2
Miriam        1
Lucille       1
Myna          1
Amelia        1
Helen         1
Vera          1
Juliette      1
Elna          1
Rosalie       1
Eliza         1
Sylvia        1
             ..
Mantoura      1
Elin          1
Latifa        1
Bertha        1
Hannah        1
Adele         1
Emelia        1
Margaretta    1
Dorothy       1
Bessie        1
Alfrida       1
Lucy          1
Edwiga        1
Grace         1
Lulu          1
Amy           1
Hanne         1
Lilian        1
Alma          1
Marian        1
Lillian       1
Cordelia      1
Irene         1
Augusta       1
Leila         1
Lutie         1
Annie         1
Sallie        1
Madeleine     1
Jessie        1
Name: name, dtype: int64

In [21]:
data['Name'].where(data['Sex'] == 'female').str.extract('(?<=M[is|r]s\.\s)(?P<name>\w+)(?!.*\()', expand=False)

PassengerId
1         NaN
2         NaN
3         NaN
4         NaN
5         NaN
6         NaN
7         NaN
8         NaN
9         NaN
10        NaN
11        NaN
12        NaN
13        NaN
14        NaN
15        NaN
16        NaN
17        NaN
18        NaN
19        NaN
20     Fatima
21        NaN
22        NaN
23        NaN
24        NaN
25        NaN
26        NaN
27        NaN
28        NaN
29        NaN
30        NaN
        ...
862       NaN
863       NaN
864       NaN
865       NaN
866       NaN
867       NaN
868       NaN
869       NaN
870       NaN
871       NaN
872       NaN
873       NaN
874       NaN
875       NaN
876       NaN
877       NaN
878       NaN
879       NaN
880       NaN
881       NaN
882       NaN
883       NaN
884       NaN
885       NaN
886       NaN
887       NaN
888       NaN
889       NaN
890       NaN
891       NaN
Name: name, dtype: object

In [ ]:
data['Name'].where(data['Sex'] == 'female')

In [ ]:
import numpy as np
from sklearn.tree import DecisionTreeClassifier
X = np.array([[1, 2], [3, 4], [5, 6]])
y = np.array([0, 1, 0])
clf = DecisionTreeClassifier()
clf.fit(X, y)

In [ ]:
importances = clf.feature_importances_

In [ ]:
importances

In [23]:
data[:10]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [70]:
df = pandas.DataFrame({
        'Pclass': data.Pclass,
        'Fare': data.Fare,
        'Age': data.Age,
        'Sex': data.Sex,
        'Survived': data.Survived,
})

In [54]:
df[:10]

              Age     Fare  Pclass     Sex  Survived
PassengerId
1            22.0   7.2500       3    male         0
2            38.0  71.2833       1  female         1
3            26.0   7.9250       3  female         1
4            35.0  53.1000       1  female         1
5            35.0   8.0500       3    male         0
6             NaN   8.4583       3    male         0
7            54.0  51.8625       1    male         0
8             2.0  21.0750       3    male         0
9            27.0  11.1333       3  female         1
10           14.0  30.0708       2  female         1

In [71]:
import numpy as np
from sklearn.tree import DecisionTreeClassifier
df.Sex=df.Sex.apply(lambda x: 1 if x=='male' else 0)
df = df.dropna(axis=0)

In [72]:
survived = pandas.DataFrame({'Survived': df.Survived})
trainDf = df.drop('Survived', 1)
trainDf

              Age      Fare  Pclass  Sex
PassengerId
1            22.0    7.2500       3    1
2            38.0   71.2833       1    0
3            26.0    7.9250       3    0
4            35.0   53.1000       1    0
5            35.0    8.0500       3    1
7            54.0   51.8625       1    1
8             2.0   21.0750       3    1
9            27.0   11.1333       3    0
10           14.0   30.0708       2    0
11            4.0   16.7000       3    0
12           58.0   26.5500       1    0
13           20.0    8.0500       3    1
14           39.0   31.2750       3    1
15           14.0    7.8542       3    0
16           55.0   16.0000       2    0
17            2.0   29.1250       3    1
19           31.0   18.0000       3    0
21           35.0   26.0000       2    1
22           34.0   13.0000       2    1
23           15.0    8.0292       3    0
24           28.0   35.5000       1    1
25            8.0   21.0750       3    0
26           38.0   31.3875       3    0
28           19.0  263.0000       1    1
31           40.0   27.7208       1    1
34           66.0   10.5000       2    1
35           28.0   82.1708       1    1
36           42.0   52.0000       1    1
38           21.0    8.0500       3    1
39           18.0   18.0000       3    0
...           ...       ...     ...  ...
857          45.0  164.8667       1    0
858          51.0   26.5500       1    1
859          24.0   19.2583       3    0
861          41.0   14.1083       3    1
862          21.0   11.5000       2    1
863          48.0   25.9292       1    0
865          24.0   13.0000       2    1
866          42.0   13.0000       2    0
867          27.0   13.8583       2    0
868          31.0   50.4958       1    1
870           4.0   11.1333       3    1
871          26.0    7.8958       3    1
872          47.0   52.5542       1    0
873          33.0    5.0000       1    1
874          47.0    9.0000       3    1
875          28.0   24.0000       2    0
876          15.0    7.2250       3    0
877          20.0    9.8458       3    1
878          19.0    7.8958       3    1
880          56.0   83.1583       1    0
881          25.0   26.0000       2    0
882          33.0    7.8958       3    1
883          22.0   10.5167       3    0
884          28.0   10.5000       2    1
885          25.0    7.0500       3    1
886          39.0   29.1250       3    0
887          27.0   13.0000       2    1
888          19.0   30.0000       1    0
890          26.0   30.0000       1    1
891          32.0    7.7500       3    1

[714 rows x 4 columns]

In [79]:
classes = survived.as_matrix()
train = trainDf.as_matrix()
clf = DecisionTreeClassifier(random_state=241)
clf.fit(train, classes)
importances = clf.feature_importances_
importances

array([ 0.2560461 ,  0.30343647,  0.14000522,  0.30051221])

In [81]:
trainDf.columns

Index([u'Age', u'Fare', u'Pclass', u'Sex'], dtype='object')

In [82]:
def write_answer_to_file(answer, filename):
    with open(filename, 'w') as f_out:
        f_out.write(answer)
write_answer_to_file('Fare Sex', '7.answer')